feat(config): Add Environment Secret Zod schemas (#1)
